brycel/ContikiCC2530Port/contiki-2.5/cpu/cc253x/cc253xSDCC.h
/*
 * Copyright (c) 2011, George Oikonomou - <oikonomou@users.sourceforge.net>
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the Institute nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 * This file is part of the Contiki operating system.
 */

/**
 * \file
 *   Definitions for TI/Chipcon cc2530, cc2531 and cc2533 SFR registers.
 *
 *   Based on information in:
 *   "CC253x System-on-Chip Solution for 2.4-GHz IEEE 802.15.4 and ZigBee®
 *    Applications"
 *   Literature Number: SWRU191B. April 2009–Revised September 2010
 *
 * \author
 *         George Oikonomou - <oikonomou@users.sourceforge.net>
 */

#ifndef __CC253X_H__
#define __CC253X_H__

/*---------------------------------------------------------------------------*/
/* Compiler Abstraction */
//#include <compiler.h>
/*---------------------------------------------------------------------------
 * Interrupt Vectors
 * (Table 2.5, page 40)
 *---------------------------------------------------------------------------*/
#define RFERR_VECTOR     0  /* RF TXFIFO underflow and RXFIFO overflow. */
#define ADC_VECTOR       1  /* ADC end of conversion */
#define URX0_VECTOR      2  /* USART 0 RX complete */
#define URX1_VECTOR      3  /* USART 1 RX complete */
#define ENC_VECTOR       4  /* AES encryption/decryption complete */
#define ST_VECTOR        5  /* Sleep Timer compare */
#define P2INT_VECTOR     6  /* Port 2 inputs/USB/I2C */
#define UTX0_VECTOR      7  /* USART 0 TX complete */
#define DMA_VECTOR       8  /* DMA transfer complete */
#define T1_VECTOR        9  /* Timer 1 (16-bit) capture/compare/overflow */
#define T2_VECTOR       10  /* Timer 2 (MAC Timer) */
#define T3_VECTOR       11  /* Timer 3 (8-bit) compare/overflow */
#define T4_VECTOR       12  /* Timer 4 (8-bit) compare/overflow */
#define P0INT_VECTOR    13  /* Port 0 inputs */
#define UTX1_VECTOR     14  /* USART1 TX complete */
#define P1INT_VECTOR    15  /* Port 1 inputs */
#define RF_VECTOR       16  /* RF general interrupts */
#define WDT_VECTOR      17  /* Watchdog overflow in timer mode */
/*---------------------------------------------------------------------------
 * Special Function Registers and BITs
 * (Table 2.1, page 27)
 *---------------------------------------------------------------------------*/
/* 8051 Internals */
SFR(P0,        0x80); /* Port 0 */
  SBIT(P0_7,     0x80, 7); /* Port 0 bit 7 */
  SBIT(P0_6,     0x80, 6); /* Port 0 bit 6 */
  SBIT(P0_5,     0x80, 5); /* Port 0 bit 5 */
  SBIT(P0_4,     0x80, 4); /* Port 0 bit 4 */
  SBIT(P0_3,     0x80, 3); /* Port 0 bit 3 */
  SBIT(P0_2,     0x80, 2); /* Port 0 bit 2 */
  SBIT(P0_1,     0x80, 1); /* Port 0 bit 1 */
  SBIT(P0_0,     0x80, 0); /* Port 0 bit 0 */
SFR(SP,        0x81); /* Stack pointer */
SFR(DPL0,      0x82); /* Data pointer 0 low byte */
SFR(DPH0,      0x83); /* Data pointer 0 high byte */
SFR(DPL1,      0x84); /* Data pointer 1 low byte */
SFR(DPH1,      0x85); /* Data pointer 1 high byte */
SFR(PCON,      0x87); /* Power mode control */
SFR(TCON,      0x88); /* Interrupt flags */
  SBIT(URX1IF,   0x88, 7); /* USART1 RX interrupt flag */
  SBIT(ADCIF,    0x88, 5); /* ADC interrupt flag */
  SBIT(URX0IF,   0x88, 3); /* USART0 RX interrupt flag */
  SBIT(IT1,      0x88, 2); /* Reserved. Must always be set to 1 */
  SBIT(RFERRIF,  0x88, 1); /* RF TXFIFO/RXFIFO interrupt flag */
  SBIT(IT0,      0x88, 0); /* Reserved. Must always be set to 1 */
SFR(P1,        0x90); /* Port 1 */
  SBIT(P1_7,     0x90, 7); /* Port 1 bit 7 */
  SBIT(P1_6,     0x90, 6); /* Port 1 bit 6 */
  SBIT(P1_5,     0x90, 5); /* Port 1 bit 5 */
  SBIT(P1_4,     0x90, 4); /* Port 1 bit 4 */
  SBIT(P1_3,     0x90, 3); /* Port 1 bit 3 */
  SBIT(P1_2,     0x90, 2); /* Port 1 bit 2 */
  SBIT(P1_1,     0x90, 1); /* Port 1 bit 1 */
  SBIT(P1_0,     0x90, 0); /* Port 1 bit 0 */
SFR(DPS,       0x92); /* Data pointer select */
SFR(S0CON,     0x98); /* Interrupt flags 2 */
  SBIT(ENCIF_1,  0x98, 1); /* AES Interrupt flag 1 */
  SBIT(ENCIF_0,  0x98, 0); /* AES Interrupt flag 0 */
SFR(IEN2,      0x9A); /* Interrupt enable 2 */
SFR(S1CON,     0x9B); /* Interrupt flags 3 */
SFR(P2,        0xA0); /* Port 2 */
  SBIT(P2_7,     0xA0, 7); /* Port 2 bit 7 */
  SBIT(P2_6,     0xA0, 6); /* Port 2 bit 6 */
  SBIT(P2_5,     0xA0, 5); /* Port 2 bit 5 */
  SBIT(P2_4,     0xA0, 4); /* Port 2 bit 4 */
  SBIT(P2_3,     0xA0, 3); /* Port 2 bit 3 */
  SBIT(P2_2,     0xA0, 2); /* Port 2 bit 2 */
  SBIT(P2_1,     0xA0, 1); /* Port 2 bit 1 */
  SBIT(P2_0,     0xA0, 0); /* Port 2 bit 0 */
SFR(IEN0,      0xA8); /* Interrupt enable 0 */
  SBIT(EA,       0xA8, 7); /* All interrupts - enable/disable */
  SBIT(STIE,     0xA8, 5); /* Sleep Timer interrupt enable */
  SBIT(ENCIE,    0xA8, 4); /* AES encryption/decryption interrupt enable */
  SBIT(URX1IE,   0xA8, 3); /* USART1 RX interrupt enable */
  SBIT(URX0IE,   0xA8, 2); /* USART0 RX interrupt enable */
  SBIT(ADCIE,    0xA8, 1); /* ADC interrupt enable */
  SBIT(RFERRIE,  0xA8, 0); /* RF TXFIFO/RXFIFO interrupt enable */
SFR(IP0,       0xA9); /* Interrupt priority 0 */
SFR(IEN1,      0xB8); /* Interrupt enable 1 */
  SBIT(P0IE,     0xB8, 5); /* Port 0 interrupt enable */
  SBIT(T4IE,     0xB8, 4); /* Timer 4 interrupt enable */
  SBIT(T3IE,     0xB8, 3); /* Timer 3 interrupt enable */
  SBIT(T2IE,     0xB8, 2); /* Timer 2 interrupt enable */
  SBIT(T1IE,     0xB8, 1); /* Timer 1 interrupt enable */
  SBIT(DMAIE,    0xB8, 0); /* DMA Transfer interrupt enable */
SFR(IP1,       0xB9); /* Interrupt priority 1 */
SFR(IRCON,     0xC0); /* Interrupt flags 4 */
  SBIT(STIF,     0xC0, 7); /* Sleep Timer interrupt flag */
  SBIT(P0IF,     0xC0, 5); /* Port 0 interrupt flag */
  SBIT(T4IF,     0xC0, 4); /* Timer 4 interrupt flag */
  SBIT(T3IF,     0xC0, 3); /* Timer 3 interrupt flag */
  SBIT(T2IF,     0xC0, 2); /* Timer 2 interrupt flag */
  SBIT(T1IF,     0xC0, 1); /* Timer 1 interrupt flag */
  SBIT(DMAIF,    0xC0, 0); /* DMA-complete interrupt flag */
SFR(PSW,       0xD0); /* Program status word */
  SBIT(CY,       0xD0, 7); /* Carry flag */
  SBIT(AC,       0xD0, 6); /* Auxiliary carry flag */
  SBIT(F0,       0xD0, 5); /* User-defined flag 1, bit addressable */
  SBIT(RS1,      0xD0, 4); /* Register bank select, bit 1 */
  SBIT(RS0,      0xD0, 3); /* Register bank select, bit 0 */
  SBIT(OV,       0xD0, 2); /* Overflow flag */
  SBIT(F1,       0xD0, 1); /* User-defined flag 0, bit addressable */
  SBIT(P,        0xD0, 0); /* Parity flag */
SFR(ACC,       0xE0); /* Accumulator */
  SBIT(ACC_7,    0xE0, 7); /* Accumulator bit 7 */
  SBIT(ACC_6,    0xE0, 6); /* Accumulator bit 6 */
  SBIT(ACC_5,    0xE0, 5); /* Accumulator bit 5 */
  SBIT(ACC_4,    0xE0, 4); /* Accumulator bit 4 */
  SBIT(ACC_3,    0xE0, 3); /* Accumulator bit 3 */
  SBIT(ACC_2,    0xE0, 2); /* Accumulator bit 2 */
  SBIT(ACC_1,    0xE0, 1); /* Accumulator bit 1 */
  SBIT(ACC_0,    0xE0, 0); /* Accumulator bit 0 */
SFR(IRCON2,    0xE8); /* Interrupt flags 5 */
  SBIT(WDTIF,    0xE8, 4); /* Watchdog Timer interrupt flag */
  SBIT(P1IF,     0xE8, 3); /* Port 1 Interrupt flag */
  SBIT(UTX1IF,   0xE8, 2); /* USART1 TX interrupt flag */
  SBIT(UTX0IF,   0xE8, 1); /* USART0 TX interrupt flag */
  SBIT(P2IF,     0xE8, 0); /* Port 2 interrupt flag */
SFR(B,         0xF0); /* B Register */
  SBIT(B_7,      0xF0, 7); /* Register B bit 7 */
  SBIT(B_6,      0xF0, 6); /* Register B bit 6 */
  SBIT(B_5,      0xF0, 5); /* Register B bit 5 */
  SBIT(B_4,      0xF0, 4); /* Register B bit 4 */
  SBIT(B_3,      0xF0, 3); /* Register B bit 3 */
  SBIT(B_2,      0xF0, 2); /* Register B bit 2 */
  SBIT(B_1,      0xF0, 1); /* Register B bit 1 */
  SBIT(B_0,      0xF0, 0); /* Register B bit 0 */

